% 3次B样条插值
clear;
clc;
 
% 定义控制点
% x = [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115];
% y = [0, 0, 0, -1, -3, -4, -6, -8, -11, -12, -11, -11, -11, -11, -12, -13, -15, -18, -19, -21, -23, -22, -24, -24];
% z = [-2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2];
N=10;
% x = linspace(1,N,N)+ 0.2*rand(1,N);
% y = linspace(1,N,N)+ 0.2*rand(1,N);
% z = linspace(1,N,N)+ 0.2*rand(1,N);
x =[   -1.7520   -3.0639   -4.3861   -5.7166   -7.0658   -8.4217   -9.7971  -11.1795  -12.5813  -14.0023];
y=[   -0.0000    0.0000    0.0000   -0.0000    0.0000   -0.0000    0.0000   -0.000    0.00   -0.00];
z=[    0.9493    1.5537    2.1353    2.6975    3.2133    3.7113    4.1526    4.5716    4.9196    5.1788];
n=length(x)-1;% B样条曲线有n+1个控制点
k=4;% 三次B样条，因此阶数=次数+1
 
% 用于储存生成的点
X=[];
Y=[];
Z=[];
 
Nik_u=zeros(1,n+1);% 用于储存基函数
nodevector=U_quasi_uniform(n,k);% 生成节点向量
figure
plot3(x,y,z,'r');
hold on

for u=0:0.01:1-0.01% 循环次数决定组成B样条曲线点的总数量
    for j=1:n+1% 生成Bi,3这一系列基函数
        Nik_u(j)=BaseFunction(j,k,u,nodevector);
    end
    % 由于B样条曲线具有局部支撑性，因此只有u周围一定区间会参与到计算
    X=[X,x*Nik_u'];
    Y=[Y,y*Nik_u'];
    Z=[Z,z*Nik_u'];
end
plot3(X,Y,Z,'b')

p = zeros(3,20);
index = 1;
for i=1:length(X)/20:100
    p(:,index)=[X(i),Y(i),Z(i)];
    index = index+1;
end
plot3(p(1,:),p(2,:),p(3,:),'b');